app/controllers/events_controller.rb

SELECT `events`.* FROM `events`
---
    def index
    render json: Event.all,status: :ok

SELECT `events`.* FROM `events` WHERE `events`.`id` = 1 LIMIT 1
---
    def find_event
        Event.find(params[:id])