app/controllers/home_banners_controller.rb

SELECT `home_banners`.* FROM `home_banners`
---
    def index
        banners = HomeBanner.all