app/controllers/tickets_controller.rb

    def index
        render json: Ticket.all, status: :ok
---
SELECT `tickets`.* FROM `tickets`

    def create
        if params.present?
            phone = PhonyRails.normalize_number(params[:phone_number],country_code: "KE").gsub(/\W/, "")
            ticket = Ticket.new(ticket_params)

            if ticket.save
---
INSERT INTO `tickets` (`ticket_no`, `user_id`, `event_id`, `is_vip`, `number_of_vip_tickets`, `is_regular`, `number_of_regular_tickets`, `amount`, `phone_number`, `created_at`, `updated_at`) VALUES ('MusAfri2', 3, 1, FALSE, 0, TRUE, 2, 2400, '0727249154', '2022-10-28 10:08:01.831090', '2022-10-28 10:08:01.831090')