app/controllers/transactions_controller.rb

    def create
        if params[:Body][:stkCallback][:Item].present?
            render json:{message: "Successfully payment"}
        else
        transaction = Transaction.create!(transaction_params)
---
INSERT INTO `transactions` (`MerchantRequestID`, `CheckoutRequestID`, `ResponseDescription`, `ResponseCode`, `CustomerMessage`, `age`, `created_at`, `updated_at`) VALUES ('Hello', 'Guys', 'You', 0, 'Great', NULL, '2022-10-29 11:44:58.635552', '2022-10-29 11:44:58.635552')